
#### Terraform Format and Style 🖌  : `success`
#### Terraform Initialization ⚙ : `success`
#### Terraform Plan 📖 : `success`

<details><summary>Show Plan</summary>

```[command]/home/runner/work/_temp/3fb7a08f-df8b-43c1-a28d-aa120cd1a685/terraform-bin plan -no-color -var aws_key_id=AKIARTUVRGMOVSMSG2H2 -var aws_key_secret=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

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.tf_playground_bucket will be created
  + resource "aws_s3_bucket" "tf_playground_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "test-1241vajgha12414jffhag124h"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Github-Demo"
          + "Name"        = "Demo Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Github-Demo"
          + "Name"        = "Demo Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.tf_playground_bucket_2 will be created
  + resource "aws_s3_bucket" "tf_playground_bucket_2" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "test-1241vajgha12414jffhag124h2"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Github-Demo"
          + "Name"        = "Demo Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Github-Demo"
          + "Name"        = "Demo Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_bucket.tf_playground_bucket will be created%0A  + resource "aws_s3_bucket" "tf_playground_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = "private"%0A      + arn                         = (known after apply)%0A      + bucket                      = "test-1241vajgha12414jffhag124h"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "Github-Demo"%0A          + "Name"        = "Demo Bucket"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "Github-Demo"%0A          + "Name"        = "Demo Bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A    }%0A%0A  # aws_s3_bucket.tf_playground_bucket_2 will be created%0A  + resource "aws_s3_bucket" "tf_playground_bucket_2" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = "private"%0A      + arn                         = (known after apply)%0A      + bucket                      = "test-1241vajgha12414jffhag124h2"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "Github-Demo"%0A          + "Name"        = "Demo Bucket"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "Github-Demo"%0A          + "Name"        = "Demo Bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_bucket.tf_playground_bucket will be created%0A  + resource "aws_s3_bucket" "tf_playground_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = "private"%0A      + arn                         = (known after apply)%0A      + bucket                      = "test-1241vajgha12414jffhag124h"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "Github-Demo"%0A          + "Name"        = "Demo Bucket"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "Github-Demo"%0A          + "Name"        = "Demo Bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A    }%0A%0A  # aws_s3_bucket.tf_playground_bucket_2 will be created%0A  + resource "aws_s3_bucket" "tf_playground_bucket_2" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = "private"%0A      + arn                         = (known after apply)%0A      + bucket                      = "test-1241vajgha12414jffhag124h2"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "Github-Demo"%0A          + "Name"        = "Demo Bucket"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "Github-Demo"%0A          + "Name"        = "Demo Bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::set-output name=stderr::
::set-output name=exitcode::0
```

</details>


*Pusher: @dumitraand, Action: `pull_request`*